# -*- coding:utf-8-*-
print("\nbilibili 经验计算器")
print("作者：呵呵十三太")

z_1 = input("\n\n目标经验值：")
#填入升级所需经验值

z_2 = input("现有经验值：")
#填入现有经验值


a_1 = z_1 - z_2

print("\n距离升级还需要" + str(a_1) + "经验值")

g_1 = a_1 / 10

print("\n每日只登陆观看视频需要" + str(g_1) + "天升级")

g_2 = a_1 / 20
g_3 = a_1 / 30
g_4 = a_1 / 40
g_5 = a_1 / 50
g_6 = a_1 / 60

print("\n每天登陆观看视频并投出一个硬币需要" + str(g_2) + "天升级")

print("每天登陆观看视频并投出两个硬币需要" + str(g_3) + "天升级")

print("每天登陆观看视频并投出三个硬币需要" + str(g_4) + "天升级")

print("每天登陆观看视频并投出四个硬币需要" + str(g_5) + "天升级")

print("每天登陆观看视频并投出五个硬币需要" + str(g_6) + "天升级")

g_7 = a_1 / 25

print("\n每天登陆观看视频分享并投出一个硬币需要" + str(g_7) + "天升级")


