# -*- coding:utf-8-*-

name = ["wwb","zz","why","szb","ljx"]

print("任务1")
print("----------------------------分界线----------------------------------")

print(name[0].upper() + " 我邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房")

print(name[1].upper() + " 我邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房")

print(name[2].upper() + " 我邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房")

print(name[3].upper() + " 我邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房")

print(name[4].upper() + " 我邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房")

print("\n任务2")
print("----------------------------分界线----------------------------------")

name_x = "why"
name.remove(name_x)

name.insert(2,"zyt")


print("hi " + name[0].upper() + " 刚刚得到消息我们的同学 " + name_x + " 因为想要考到全年级第一，所以在家努力复习，无法赶来。")

print("hi " + name[1].upper() + " 刚刚得到消息我们的同学 " + name_x + " 因为想要考到全年级第一，所以在家努力复习，无法赶来。")

print("hi " + name[2].upper() + " 欢迎来参加我的生日派对")

print("hi " + name[3].upper() + " 刚刚得到消息我们的同学 " + name_x + " 因为想要考到全年级第一，所以在家努力复习，无法赶来。")

print("hi " + name[4].upper() + " 刚刚得到消息我们的同学 " + name_x + " 因为想要考到全年级第一，所以在家努力复习，无法赶来。")

print("\n任务3")
print("----------------------------分界线----------------------------------")

print("hi，我又找到了个更大的餐桌，还可以再坐下3个人！")

name.insert(0,"zyx")
name.insert(3,"gyj")
name.append("zke")

print("hi " + name[0].upper() + " 再次正式邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房！")

print("hi " + name[1].upper() + " 再次正式邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房！")

print("hi " + name[2].upper() + " 再次正式邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房！")

print("hi " + name[3].upper() + " 再次正式邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房！")

print("hi " + name[4].upper() + " 再次正式邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房！")

print("hi " + name[5].upper() + " 再次正式邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房！")

print("hi " + name[6].upper() + " 再次正式邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房！")

print("hi " + name[7].upper() + " 再次正式邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房！")

print("\n任务4")
print("----------------------------分界线----------------------------------")

print("十分抱歉，对不起大家，因为大桌子运送出现些问题，导致只能邀请两位同学。")

print("\n")

name_x = name.pop(0)
print(name_x.upper() + " 十分抱歉，因为桌子的运送问题无法邀请你来参加这次聚会，呃，这个教材有点过分。。。捂脸。")

name_x = name.pop(2)
print(name_x.upper() + " 十分抱歉，因为桌子的运送问题无法邀请你来参加这次聚会，呃，这个教材有点过分。。。捂脸。")

name_x = name.pop(2)
print(name_x.upper() + " 十分抱歉，因为桌子的运送问题无法邀请你来参加这次聚会，呃，这个教材有点过分。。。捂脸。")

name_x = name.pop(2)
print(name_x.upper() + " 十分抱歉，因为桌子的运送问题无法邀请你来参加这次聚会，呃，这个教材有点过分。。。捂脸。")

name_x = name.pop(2)
print(name_x.upper() + " 十分抱歉，因为桌子的运送问题无法邀请你来参加这次聚会，呃，这个教材有点过分。。。捂脸。")

name_x = name.pop(2)
print(name_x.upper() + " 十分抱歉，因为桌子的运送问题无法邀请你来参加这次聚会，呃，这个教材有点过分。。。捂脸。")

print("\n")


print("hi " + name[0].upper() + " 再再次正式邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房！")

print("hi " + name[1].upper() + " 再再次正式邀请你来参加我的生日派对，在5月31日，朝阳门南小街康中福大药房！")

print("两位星标 滑稽")

del name[0]
del name[0]

print(name)







